{
    "menuList": ["home", "about", "resume", "works", "contact"],
    "works": [
         {
            "src": "/works/a.png",
            "desc": "AAS"
        },
        {
            "src": "/works/b.png",
            "desc": "Flexsystem"
        },
        {
            "src": "/works/c.png",
            "desc": "RichFame"
        },
        {
            "src": "/works/d.png",
            "desc": "RichFrame"
        },
        {
            "src": "/works/e.png",
            "desc": "AAS-Migration"
        }
    ],
    "eduList": [
        {
            "type": "Education",
            "title": "The City University of Hong Kong",
            "subtitle": "BSc Computer Science",
            "range": "Sep 2017 - Jun 2020",
            "descriptions": []
        }
    ],
    "workList": [
        {
            "type": "Work",
            "title": "AAS Education Consultancy (Freelance)",
            "subtitle": "Web Developer, Asia",
            "range": "Sep 2019 - Present",
            "descriptions": [
                "Conducted assistance and resolved clients' technical issues.",
                "Managed and optimized the customer information in Zoho CRM.",
                "Generated informative charts and graphs for the team leader using Power BI and Google Data Studio.",
                "Proficient in using Git rebase for history cleanup and branch updates, leading to a more coherent commit history​"
            ]
        },
        {
            "type": "",
            "title": "Rich Fame International Limited",
            "subtitle": "Web Developer, Asia",
            "range": "Aug 2022 - Feb 2023",
            "descriptions": [
                "Built a single web page of a cargo online application system for internal use to replace hand-written legacy to store shipment details using React, Redux, Ant Design, CSS",
                "Maintain Wordpress website using PHP 7.2, Wordpress 6.1.1, WP Engine by ensuring uptime, fixing bugs and modifying custom theme",
                "Involved and built a webpage for a Product management system (PMS) using Vue and PHP 5.6",
                "Integrate RESTful APIs for data retrieval and manipulation within Vue and React applications"
            ]
        },
        {
            "type": "",
            "title": "Flexsystem",
            "subtitle": "Full Stack Developer, Asia",
            "range": "May 2021 - Aug 2022",
            "descriptions": [
                "Revamped an existing Angular 1.5 web application to Angular 11 in production for esteemed clients, including the Agricultural Bank of China, HKEAA, Great Eagle, and R&D initiatives",
                "Maintained Angular web applications using Angular, Bootstrap 4, C# and ISAM",
                "Responsible for building the web layout of a Customer Relationship Management (CRM) using ASP.NET MVC 5, HTML, CSS, jQuery and Entity Framework",
                "Modernized design and reduced bugs on many Angular widgets​",
                "Implementing CSS3 Grid and Flexbox layouts to create complex and responsive page designs"
            ]
        },
        {
            "type": "",
            "title": "Boxland Hong Kong Limited",
            "subtitle": "Internship Programmer, Asia",
            "range": "Sep 2018 - Jun 2019",
            "descriptions": [
                "Supported, maintained and developed a Hybrid application using Angular and Ionic.",
                "Assisted in connecting web sockets from hardware devices to display data within the application.",
                "Developed an iOS application for bulk RFID tag scanning, and provided real-time data transfer."
            ]
        },
        {
            "type": "",
            "title": "MAD Mobile Application Development Limited",
            "subtitle": "Internship Programmer, Asia",
            "range": "Sep 2018 - Jun 2019",
            "descriptions": [
                "Learned and applied new technologies and assisted in developing with Android studio.",
                "Designed and built a booking searching Android application connecting to the MAD glass.",
                "Identified and resolved software issue with debugging techniques."
            ]
        }
    ],
    "skillsList": {
        "type": "Skills",
        "skills": [
            "Python",
            "TypeScript",
            "C#",
            "HTML5",
            "CSS",
            "JavaScript",
            "jQuery",
            "Angular",
            "React.js",
            "Ionic",
            "Tailwind",
            "Bootstrap",
            "Material Design",
            "ASP.NET MVC",
            "Node.js",
            "Express",
            "RESTful APIs",
            "MongoDB",
            "MySQL",
            "MS Office",
            "WordPress",
            "Power BI",
            "Socket.io",
            "AWS EC2",
            "AWS S3",
            "AWS Route 53",
            "AWS CloudFront",
            "Git",
            "BitBucket"
        ]
    }
}